src/main/resources/user-request.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:us="http://dickaspring.com/spring-boot-soap-demo">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>dicka</us:name>
        </us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>